In [1]:
import pandas as pd
import os

student_data = os.path.join('Documents', 'Student_Data_Challenge_Starter_Code', 'Resources', 'new_full_student_data.csv')
student_df = pd.read_csv(student_data)

In [2]:
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

In [3]:
student_df.isna().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1968
math_score        982
school_type         0
school_budget       0
dtype: int64

In [4]:
student_df = student_df.dropna()

In [5]:
student_df.isna().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [6]:
student_df.duplicated().sum()

1836

In [7]:
student_df = student_df.drop_duplicates()

In [8]:
student_df.duplicated().sum()

0

In [9]:
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [10]:
student_df['grade']

0         9th
1         9th
2         9th
3         9th
5         9th
         ...
19508    10th
19509    12th
19511    11th
19512    11th
19513    12th
Name: grade, Length: 14831, dtype: object

In [11]:
student_df['grade'] = student_df['grade'].str.replace('th', '')
student_df['grade']

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: object

In [12]:
student_df['grade'] = student_df['grade'].astype(int)

In [13]:
student_df.dtypes

student_id         int64
student_name      object
grade              int32
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [14]:
student_df.describe()

         student_id         grade  reading_score    math_score  school_budget
count  1.483100e+04  14831.000000   14831.000000  14831.000000   14831.000000
mean   6.975296e+07     10.355539      72.357865     64.675733  893742.749107
std    3.452909e+07      1.097728      15.224590     15.844093   53938.066467
min    1.000906e+07      9.000000      10.500000      3.700000  817615.000000
25%    3.984433e+07      9.000000      62.200000     54.500000  846745.000000
50%    6.965978e+07     10.000000      73.800000     65.300000  893368.000000
75%    9.927449e+07     11.000000      84.000000     76.000000  956438.000000
max    1.299997e+08     12.000000     100.000000    100.000000  991918.000000

In [15]:
student_df.mean()

C:\Users\14072\anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  """Entry point for launching an IPython kernel.

student_id       6.975296e+07
grade            1.035554e+01
reading_score    7.235787e+01
math_score       6.467573e+01
school_budget    8.937427e+05
dtype: float64

In [16]:
min_reading_score = student_df['reading_score'].min()

In [17]:
min_reading_score

10.5

In [18]:
student_df.iloc[0]

student_id                  103880842
student_name            Travis Martin
grade                               9
school_name      Sullivan High School
reading_score                    59.0
math_score                       88.2
school_type                    Public
school_budget                  961125
Name: 0, dtype: object

In [41]:
student_df.loc[:, 'grade']

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: int32

In [29]:
student_df.iloc[0:3,[3,4,5]]

            school_name  reading_score  math_score
0  Sullivan High School           59.0        88.2
1     Dixon High School           94.7        73.5
2    Wagner High School           89.0        70.4

In [43]:
grade_df = student_df.loc[student_df['grade'] == 9]

In [44]:
grade_df.describe()

         student_id   grade  reading_score   math_score  school_budget
count  4.132000e+03  4132.0    4132.000000  4132.000000    4132.000000
mean   6.979441e+07     9.0      69.236713    66.585624  898692.606002
std    3.470565e+07     0.0      15.277354    16.661533   54891.596611
min    1.000906e+07     9.0      17.900000     5.300000  817615.000000
25%    3.953848e+07     9.0      59.000000    56.000000  846745.000000
50%    6.984037e+07     9.0      70.050000    67.800000  893368.000000
75%    9.939504e+07     9.0      80.500000    78.500000  957299.000000
max    1.299997e+08     9.0      99.900000   100.000000  991918.000000

In [60]:
min_reading_row = student_df["reading_score"].min()
min_reading_row = student_df.loc[student_df["reading_score"] == min_reading_score]
min_reading_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
3706,81758630,Matthew Thomas,10,Dixon High School,10.5,58.4,Charter,870334

In [81]:
dixon_student_df=student_df.loc[student_df["school_name"] == "Dixon High School"]
dixon_student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
1,45069750,Michael Brown,9,Dixon High School,94.7,73.5,Charter,870334
32,10848508,Brenda Carey,12,Dixon High School,90.3,57.9,Charter,870334
45,103118608,Ryan Charles,10,Dixon High School,71.1,93.1,Charter,870334
58,73841348,Karen Hart,9,Dixon High School,83.5,89.1,Charter,870334
60,86894214,Jeremiah Smith,10,Dixon High School,59.5,96.4,Charter,870334

In [82]:
dixon_grade_df = dixon_student_df.loc[dixon_student_df['grade'] == 10]
dixon_grade_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
45,103118608,Ryan Charles,10,Dixon High School,71.1,93.1,Charter,870334
60,86894214,Jeremiah Smith,10,Dixon High School,59.5,96.4,Charter,870334
69,53464729,Troy Doyle,10,Dixon High School,88.6,89.4,Charter,870334
94,41212637,Matthew Lewis,10,Dixon High School,81.5,83.2,Charter,870334
100,31831251,Jonathan Bell,10,Dixon High School,95.3,80.2,Charter,870334

In [89]:
reading_score_df = dixon_grade_df.loc[:,["school_name", "reading_score"]]
reading_score_df

             school_name  reading_score
45     Dixon High School           71.1
60     Dixon High School           59.5
69     Dixon High School           88.6
94     Dixon High School           81.5
100    Dixon High School           95.3
...                  ...            ...
19283  Dixon High School           52.9
19306  Dixon High School           58.0
19344  Dixon High School           38.0
19368  Dixon High School           84.4
19445  Dixon High School           43.9

[569 rows x 2 columns]

In [117]:
student_grade_df = student_df.loc[(student_df['grade']==11)
                                 |(student_df['grade'] == 12), "reading_score"].mean() 
mean_reading_df

72.35786528217913

In [121]:
avg_budget_by_school = student_df.groupby(by='school_type').mean()
avg_budget_by_school.loc[:, ["school_budget"]]

             school_budget
school_type
Charter      872625.656236
Public       911195.558251

In [160]:
student_count_df = student_df[['school_name','reading_score']].groupby(by='school_name', as_index=True).count()
student_count_df.rename(columns={'reading_score': 'student_count'}).sort_values('student_count', ascending=False)

                        student_count
school_name
Montgomery High School           2038
Green High School                1961
Dixon High School                1583
Wagner High School               1541
Silva High School                1109
Woods High School                1052
Sullivan High School              971
Turner High School                846
Bowers High School                803
Fisher High School                798
Richard High School               551
Campos High School                541
Odonnell High School              459
Campbell High School              407
Chang High School                 171

In [177]:
avg_math_scores_by_grade = student_df.groupby(by=['school_type','grade']).mean()
avg_math_scores_by_grade.loc[:, ["math_score"]]

                   math_score
school_type grade
Charter     9       70.077874
            10      66.443206
            11      68.024735
            12      60.212121
Public      9       63.771066
            10      63.764121
            11      59.314337
            12      63.568319